Script started on Sun 04 May 2014 06:58:58 PM PDT
You are currently using 27% (132.1 MiB) of your 488.3 MiB quota.
]0;kpscanlo@unix1:code[kpscanlo@unix1 code]$ gdb list2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.6-34.el6)
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/x/kpscanlo/private/cmps012b/lab5/lab5c-gdb-valgrind/code/list2...done.
(gdb) break main
Breakpoint 1 at 0x4005bf: file list2.c, line 16.
(gdb) run foo bar
Starting program: /afs/cats.ucsc.edu/users/x/kpscanlo/private/cmps012b/lab5/lab5c-gdb-valgrind/code/list2 foo bar
warning: Skipping deprecated .gdb_index section in /usr/lib/debug/lib64/ld-2.12.so.debug.
Do "set use-deprecated-index-sections on" before the file is read
to use the section anyway.

Breakpoint 1, main (argc=3, argv=0x7fffffffdbb8) at list2.c:16
16	   for (int argi = 0; argi < 5; ++argi) {
(gdb) print argc
$1 = 3
(gdb) print argv
$2 = (char **) 0x7fffffffdbb8
(gdb) print argv[]0]
$3 = 0x7fffffffdeb7 "/afs/cats.ucsc.edu/users/x/kpscanlo/private/cmps012b/lab5/lab5c-gdb-valgrind/code/list2"
(gdb) print argv[0][1P]1]
$4 = 0x7fffffffdf0f "foo"
(gdb) print argv[1][1P]0][1P]2]
$5 = 0x7fffffffdf13 "bar"
(gdb) print argv[2][1P]3]
$6 = 0x0
(gdb) print argv[3][1P]4]
$7 = 0x7fffffffdf17 "LANG=en_US.UTF-8"
(gdb) print argv[4][1P]5]
$8 = 0x7fffffffdf28 "USER=kpscanlo"
(gdb) print argv[5][1P]6]
$9 = 0x7fffffffdf36 "LOGNAME=kpscanlo"
(gdb) quit
A debugging session is active.

	Inferior 1 [process 2703] will be killed.

Quit anyway? (y or n) y
]0;kpscanlo@unix1:code[kpscanlo@unix1 code]$ exit
exit

Script done on Sun 04 May 2014 07:01:27 PM PDT
